# AnalysisResultSchema Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisResultSchema Properties
AnalysisResultSchema Class See Also
---
The AnalysisResultSchema type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayStyleId | ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden |
| CurrentUnits | Stores the index in the array of applicable units |
| Description | Description of analysis result in view |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| IsVisible | If true analysis result is visible in view |
| Name | Name of analysis result in view |
| Scale | Multiplier used for displaying diagram or vector values in view. |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace